Repository: lenoryv/collective.spanishdocumentation
Catalog: installing-plone/installing-plone-level1.tmx
Source language: en_us
Languages: es_ve

source: Installing Plone — Plone CMS: Open Source Content Management
es_ve: Instalación de Plone — Plone CMS: Sistema de Gestión de Contenidos de Código Abierto

source: Installing Plone
es_ve: Instalación de Plone

source: The basics of installing Plone on Windows, OS X, Linux, *BSD and nearly every other platform.
es_ve: Información básica para la instalación de Plone en Windows, OS X, Linux, BSD (distribución de software Berkeley) y prácticamente cualquier otra plataforma.

source: Installation Quick Guide
es_ve: Guía rápida de Instalación

source: How to install Plone on your box, step by step.
es_ve: Como instalar Plone, paso a paso.

source: Short version.
es_ve: Versión corta

source: Prerequisites
es_ve: Requisitos previos

source: Before installing Plone on Linux, BSD or other Unix-like operating systems, you should make sure that you have the following packages installed:
es_ve: Antes de instalar Plone en Linux, BSD, o cualquier otro sistema operativo basado en Unix, debería asegurarse que tiene los siguientes paquetes instalados:

source: gcc, a C compiler
es_ve: Compilador gcc, a C

source: g++, software to extend gcc to compile C++ code
es_ve: Software g++, extensión de gcc para compilar código C++

source: GNU make, a compilation tool
es_ve: GNU make, una herramienta de compilación

source: GNU tar, package for creating tar archives
es_ve: GNU tar, paquete para crear archivos tar

source: bzip2 and gzip decompression packages
es_ve: Paquetes para descomprimir: bzip2 y gzip

source: The following packages are also recommended, although they aren't needed to build Plone
es_ve: Los siguientes paquetes también son recomendados, pero no son necesarios para construir Plone

source: libssl, a package that allows the use of TSL with your mail server.
es_ve: libssl, le permite usar TSL como su servidor de correo electrónico.

source: readline, a GNU package that increases the ability of applications to edit terminal commands.
es_ve: readline, un paquete GNU que incrementa la capacidad de las aplicaciones para editar los comandos de Terminal.

source: Getting the Plone Installer
es_ve: Obtener el instalador de Plone

source: The installer for Linux/BSD/Unix, called the Unified Installer, can be downloaded from this page of the Plone website.
es_ve: El instalador para Linux/BSD/Unix, denominado Unified Installer (Instalador Unificado), se puede descargar de esta página en el sitio web de Plone.

source: Click on the Download Plone button and you will be taken to page that lists the various installers for Plone.
es_ve: Haga clic en Download Plone (descargar Plone), y este le llevará a la página que contiene los distintos instaladores de Plone .

source: Click on the link for the Unified Installer to begin downloading Plone.
es_ve: Haga clic en el enlace Unified Installer para comenzar la descarga de Plone.

source: After it has finished downloading, open up a terminal and change directories to where the installer file you downloaded is located.
es_ve: Después que la descarga haya finalizado, abra la Terminal y cambie los directorios donde el archivo del instalador que usted descargó está localizado.

source: Extract the installer by typing "tar xzf InstallerName ", where InstallerName is the name of the Plone Installer you downloaded.
es_ve: Descomprima el instalador escribiendo "tar xzf InstallerName ", donde InstallerName es el nombre del instalador de Plone que usted descargó.

source: In your command prompt enter the directory of the folder you just extracted.
es_ve: En su Terminal de comandos introduzca el directorio de la carpeta que usted acaba de extraer.

source: Configuring your Plone installation
es_ve: Configurando su Instalación Plone

source: The first thing you must decide when installing Plone is decide whether you would like a ZEO or a standalone installation.
es_ve: Lo primero que debe decidir al momento de instalar Plone es si quiere una instalación ZEO o una instalación autónoma.

source: You should probably use ZEO if you are going to be using Plone for any production.
es_ve: Probablemente debería escoger ZEO si va a usar Plone para cualquier producción.

source: However, if you are just testing out Plone or are going to use it for development, the standalone option would be best.
es_ve: Sin embargo, si simplemente está probando Plone o lo va a usar para formación, la opción autónoma se adecuaría mejor.

source: For a more in-depth discussion read this section.
es_ve: Para un discusión más profunda de este tema lea esta sección.

source: To initiate the installation type "./install.sh method" where method is either "standalone" or "zeo".
es_ve: Para comenzar la instalación escriba "./install.sh metho" donde method es "standalone" (autónoma) o "zeo".

source: If you would like to install Plone in server mode type "sudo ./install.sh method" or run the installation script as root some other way.
es_ve: Si desea instalar Plone en modo servidor escriba "sudo ./install.sh method" o ejecute el script de instalación como root de alguna otra manera.

source: A complete list of command-line options can be found here.
es_ve: Una lista completa de opciones de líneas de comando la puede encontrar aquí.

source: Last steps
es_ve: Últimos pasos

source: Near the end of the installation, the installer should have printed out the default username and password for your Plone installation to the terminal.
es_ve: Cercano del final de la instalación, el instalador debió haber mostrado su nombre de usuario y contraseña para su instalación Plone en la Terminal.

source: If you have trouble finding them, they are also listed inside of a text file called adminPassword.txt (which can be found in the zinstance folder of your Plone installation).
es_ve: Si tiene problemas encontrándolos, estos están también listados en un archivo de texto llamado adminPassword.txt (el cual se puede encontrar en la carpeta zinstance de la instalación de Plone).

source: To start Plone:
es_ve: Para iniciar Plone:

source: "cd" to your Plone install directory.
es_ve: Haga un "cd" al directorio de su instalación Plone.

source: Enter your zinstance folder.
es_ve: Entre en su carpeta zinstance.

source: Execute "./bin/plonectl start".
es_ve: Ejecute "./bin/plonectl start".

source: (The port Plone uses may be adjusted in buildout.cfg and then running "/bin/buildout").
es_ve: (El puerto que usa Plone se puede ajustar en buildout.cfg para luego ejecutar "/bin/buildout").

source: Browse to your instance by visting http://localhost:8080 in your web browser.
es_ve: Navegue a su instancia visitando http://localhost:8080 en su navegador web.

source: If you specified another port, use it instead of 8080.
es_ve: Si usted estableció otro puerto, use ese en vez del 8080.

source: Click on "Create a new Plone site" and enter your login information to start using Plone.
es_ve: Haga clic en "Create a new Plone site" (Crear un nuevo sitio Plone) e introduzca su información de inicio de sesión para comenzar a usar Plone.

source: Enter in the requested information and then submit the form to finish the creation of your site.
es_ve: Introduzca la información requerida y luego envíe el formulario para finalizar la creación de su sitio.

source: You can find your site at http://localhost:8080/SiteName, where "SiteName" is the Id of your Plone site.
es_ve: Usted puede encontrar su sitio en http://localhost:8080/SiteName, donde "SiteName" es el identificador de su sitio Plone.

source: To stop the Plone process run "./bin/plonectl stop".
es_ve: Para detener el proceso Plone ejecute "./bin/plonectl stop".

source: Have fun using Plone!
es_ve: ¡Diviértase usando Plone!

source: If you want to use Plone on a desktop Mac, the OS X binary installer is a good choice.
es_ve: Si usted quiere usar Plone en un escritorio Mac, el instalador binario OS X es una buena opción.

source: It uses the OS X installer and provides a visual controller.
es_ve: Este proporciona el instalador para OS X y contiene un controlador visual.

source: However, since it provides pre-compiled binaries, it's very hard to add new components that require binary builds.
es_ve: Sin embargo, ya que provee binarios pre-compilados, es muy difícil agregar nuevos componentes que requieran construcciones binarias.

source: If you need to do that, add XCode to your system and use the Unified Installer.
es_ve: Si usted tiene la necesidad realizar esa acción, pues entonces agregue XCode a su sistema y use el instalador Unificado.

source: Windows (2000, 2003, XP, Vista, 7)
es_ve: MS Windows (2000, 2003, XP, Vista, 7)

source: Getting Plone
es_ve: Obtener Plone

source: You can download Plone for Windows from this page.
es_ve: Puede descargar Plone para Windows de esta página.

source: Click on the Download Plone button.
es_ve: Haga clic en el botón Download Plone (Descargar Plone).

source: Click on the link for the Windows Installer and save it to a memorable location like your Desktop.
es_ve: Haga clic en el enlace para el instalador de Windows y guárdelo en una locación que sea fácil de recordar tal como su Escritorio.

source: Double-click the installer file to initiate the installation process.
es_ve: Haga doble-clic en el instalador para iniciar el proceso de instalación.

source: The Plone Installation Wizard
es_ve: Asistente de instalación de Plone

source: Enter the directory where you would like to install Plone to.
es_ve: Introduzca el directorio donde le gustaría instalar Plone.

source: For most people, the default entry should be fine.(Click "Next" after each step to continue)
es_ve: La mayoría de personas están de acuerdo con la ubicación predeterminada. (Haga clic en "Next" (Siguiente) al finalizar cada paso para continuar)

source: Enter in your desired username and password for the administrator account.
es_ve: Introduzca el nombre de usuario y contraseña que desee para la cuenta del administrador.

source: Review the current configuration options.
es_ve: Revise las opciones de configuración actual.

source: During the installation a progress bar will show how close the installer is to completion.
es_ve: Durante el proceso de instalación una barra mostrará que tan cerca está la instalación de completarse.

source: Mark the check boxes to show whether you would like to add Plone as a service so that it will automatically run at startup.(Note: This can be changed at any time by running "bin\instance.exe remove" from your install directory) or if you would like to run Plone after exiting the installer.
es_ve: Marque las casillas de confirmación para determinar si usted quiere agregar Plone como un servicio para que se inicie automáticamente con el inicio de Windows. (Nota: esto se puede cambiar en cualquier momento ejecutando "bin\instance.exe remove" en su directorio de instalación) o si desea ejecutar Plone después de que la instalación haya culminado.

source: Starting up Plone
es_ve: iniciando Plone

source: If you decided not to make Plone a service you can start and stop your Plone instances by going to your Plone directory in your command line and executing:
es_ve: Si usted decidió no hacer de Plone un servicio, usted lo puede iniciar y detener a través del directorio de Plone en su línea de comandos y a continuación ejecutar:

source: or by using the Plone Controller GUI.
es_ve: o mediante el uso del Controlador GUI (interfaz gráfica de usuario) de Plone.

source: The Plone Controller can be found in your menu at Start → All Programs → Plone → Plone Controller.
es_ve: El Controlador de Plone se puede encontrar en su menú de Inicio → Todos los programas → Plone → Plone Controller.

source: It is used to edit Plone's settings and to start or stop Plone.
es_ve: Este se usa para modificar la configuración de Plone, así como para iniciarlo o detenerlo.

source: If you decide that you want to make Plone a service execute:
es_ve: Ahora si usted decide hacer de Plone un servicio ejecute:

source: Likewise, to unistall Plone execute:
es_ve: Del mismo modo, para la desinstalación ejecute:

source: Once you have started an instance of Plone, you can view it by visiting http://localhost:8080 in your web browser.
es_ve: Una vez que usted haya iniciado una instancia de Plone, la puede ver visitando http://localhost:8080 en su navegador web.

source: If it won't load, make sure that your firewall hasn't blocked the TCP port 8080.
es_ve: Si no se carga, asegúrese de que su Firewall no ha bloqueado el puerto TCP 8080.

source: Have fun with Plone!
es_ve: ¡Diviértase con Plone!

source: Installing on Linux / Unix / BSD
es_ve: Instalando en Linux / Unix / BSD

source: The Unified Installer is a source-distribution kit that includes nearly everything necessary to build Plone on Linux, OS X, BSD and most Unix workalikes
es_ve: El instalador Unificado en un kit de código fuente-distribución que incluye prácticamente todo lo necesario para construir Plone en Linux, OS X, BSD y la mayoría de sistemas Unix.

source: What is the Unified Installer?
es_ve: ¿Qué es el instalador Unificado?

source: A brief introduction to the installer, the case for using it, its options and recent changes.
es_ve: Breve introducción al instalador, el caso para utilizarlo, sus opciones y cambios recientes.

source: The Unified Installer is a source installation kit for installing Python, Zope, Plone and their dependencies on Unix-like platforms.
es_ve: El instalador unificado es un kit de instalación de código fuente para instalar Python, Zope, Plone y sus dependencias en plataformas de tipo Unix.

source: It has two major components:
es_ve: Posee dos componentes principales:

source: The source packages for Python, Zope, Plone, a couple of system libraries and some Python libraries;
es_ve: Los paquetes de código fuente para Python, Zope, Plone, un par de librerías de sistema y unas librerías de Python;

source: An installation script that uses the packages to create a ready-to-run, relatively self-contained, Python/Zope/Plone install that meets the Plone community's best-practices standards.
es_ve: Un script de instalación que usa paquetes para crear una instalación lista-para-usarse, relativamente autocontrolada, de Python/Zope/Plone que cumple con los estándares de prácticas recomendadas en la comunidad Plone.

source: The new Zope/Plone install will use its own copy of Python, and the Python installed by the Unified Installer will not replace your system's copy of Python.
es_ve: La nueva instalación Zope/Plone usará, luego de terminada la instalación, su propia copia de Python que no remplazará su copia de Python en el sistema.

source: You may optionally use your system (or some other) Python, and the Unified Installer will use it without modifying it or your site libraries.
es_ve: Si lo desea, puede usar el Python de su sistema (o algún otro), y el instalador Unificado lo usará sin tener que modificarlo en las librerías de su sitio.

source: Why the Unified Installer?
es_ve: ¿Por qué el instalador Unificado?

source: Why Not System Packages/Ports?
es_ve: ¿Por qué no un sistema de Paquetes/Puertos?

source: On the Plone help lists and channel, the suggestion to "just use the Unified Installer" often draws one of two reactions:
es_ve: En las listas de ayuda y canales IRC de Plone, la sugerencia "simplemente use el instalador Unificado", generalmente resulta en una de dos reacciones:

source: I prefer to manage the source install myself, picking all the target directories;
es_ve: Yo prefiero controlar la instalación de código fuente por mí mismo, y escoger todos los directorios de destinos;

source: There's nothing wrong with that, though if you use the Unified Installer's target directories you may find it easier to get help from the Plone community.
es_ve: No hay nada malo en eso, sin embargo, si usted utiliza los directorios de destinos del instalador Unificado podrá ver que le facilitará obtener ayuda de la comunidad de Plone.

source: If you still choose to install by hand, that's fine.
es_ve: Si aún así elige instalarlos manualmente, está bien.

source: You may still find it convenient to download the Unified Installer in order to get all the packages together, and you may find it useful to read the UI's install.sh script for ideas on building particular components.
es_ve: Usted todavía puede encontrar conveniente descargar el instalador Unificado con el fin de obtener todos los paquetes juntos, y puede que le resulte útil leer el escrito de la interfaz de usuario install.sh para ideas sobre la construcción de componente particulares.

source: I prefer to use my platform's ports/packages mechanism.
es_ve: Yo prefiero usar mi mecanismo de plataformas de puertos/paquetes.

source: The history of platform packages for Zope and Plone is a troubled one.
es_ve: La historia de paquetes de plataforma para Zope y Plone es una problemática.

source: Platform packages have been of uneven quality and have used installation trees that make it difficult for the community to offer help when problems occur.
es_ve: Paquetes de plataforma han sido de calidad desigual y han utilizado árboles de instalación que dificultan la ayuda que pueda ofrecer la comunidad cuando los problemas se presentan.

source: Also, platform packages have historically been vulnerable to changes in the system Python.
es_ve: Igualmente, los paquetes de plataforma han sido históricamente vulnerables a cambios en el sistema de Python.

source: Zope/Plone is very picky about the version of Python used to run it, and an update of the system Python when some other item is installed can easily break Zope/Plone.
es_ve: Zope/Plone es muy exigente al escoger la versión de Python con la cual ejecutarse, además cualquier actualización del sistema Python, cuando otro elemento está instalado, puede fácilmente afectar o dañar a Zope/Plone.

source: At this point, you may be thinking that this just means that the packages have poorly specified dependencies.
es_ve: En este punto, puede que este pensando que esto simplemente quiere decir que los paquetes tienen deficiencias con respecto a las dependencias especificadas.

source: The Unified Installer was created because generation after generation of packages did not solve this problem.
es_ve: El instalador Unificado se creó porque generación tras generación de paquetes no resolvieron este problema.

source: Major Unified Installer Options
es_ve: Opciones principales del instalador Unificado

source: The Unified Installer for Plone has three major options:
es_ve: El instalador Unificado para Plone posee tres características principales:

source: Install as root or normal user;
es_ve: Instalar como root o como usuario normal;

source: Install as a ZEO Cluster, or a stand-alone Zope;
es_ve: Instalar como un Cluster de objetos empresariales Zope - ZEO, o una instancia autónoma de Zope;

source: Install the full kit, or just a single running instance.
es_ve: Instalar el kit completo, o una simple instancia de ejecución.

source: Each of these options are described in a separate section.
es_ve: Cada una de estas opciones están descritas en secciones separadas.

source: Note: Prior versions of the Unified Installer do not have these options
es_ve: Nota: Las versiones anteriores del instalador Unificado no vienen con estas opciones

source: Changes for Plone 4
es_ve: Cambios en Plone 4

source: The installer now includes a develop.cfg configuration file, which you may use after the initial installation to configure a common development environment.
es_ve: El instalador ahora incluye un archivo de configuración develop.cfg, el cual puede usar después de la instalación inicial para configurar un entorno común de desarrollo.

source: To use it, run buildout with the command:
es_ve: Para usarlo, ejecute buildout con el comando:

source: The installer now requires that SSL development libraries be preinstalled on your system (usually done with openSSL).
es_ve: El instalador ahora requiere que las librerías de desarrollo SSL sean instaladas previamente en su sistema (usualmente se hace con openSSL)

source: If it can't find them, it halts.
es_ve: Si no las puede encontrar, este se detendrá.

source: If you wish, you may bypass this requirement, which will result in an installation that can't use ESMTP for mail.
es_ve: Si lo desea puede omitir este requerimiento, lo que resultará en una instalación que no puede usar el servicio ESMTP (extensión del Protocolo Simple de Transferencia de Correo) para correo electrónico.

source: Changes for Plone 3.1
es_ve: Cambios en Plone 3.1

source: The Unified Installer now uses buildout to configure Plone instances, which makes it much easier for you to control add-ons and upgrade your Plone installation.
es_ve: El instalador Unificado ahora usa buildout para configurar las instancias de Plone, lo que hace más fácil controlar productos adicionales y actualizaciones de su instalación Plone.

source: It's much easier to add additional Zope/Plone instances to an existing install base.
es_ve: Es mucho más sencillo agregar instancias adicionales de Zope/PLone a una base de instalación existente.

source: There are additional options for:
es_ve: Existen opciones adicionales para:

source: Controlling the installation target directory;
es_ve: Controlar el directorio de destino de la instalación;

source: Setting a user other than "admin" and/or setting a password of your choice;
es_ve: Establecer un usuario aparte del "admin" y/o configurar la contraseña de su elección;

source: Using an already installed Python 2.4 (possibly the system copy).
es_ve: El uso de una versión instalada de Python 2.4 (posiblemente una copia del sistema).

source: virtualenv is used to isolate the new installation so that your system Python is not touched.
es_ve: Se usa virtualenv para aislar la instalación nueva y así su sistema de Python no es tocado.

source: If libjpeg or libz installation is required, it's done locally to the new install.
es_ve: Si se requiere la instalación de libjpeg o libz, se hace localmente a la nueva instalación.

source: Even in a root-mode install, your system libraries are not touched.
es_ve: Incluso en un modo instalación root, sus librerías en el sistema no son tocadas.

source: Changes for Plone 3
es_ve: Cambios en Plone 3

source: If you've used the Unified Installer for prior versions of Plone, you'll already know that the options above are new.
es_ve: Si usted ha usado el instalador Unificado para versiones anteriores de Plone, ya sabrá que las opciones anteriores son nuevas.

source: There are a few additional changes:
es_ve: Hay algunos cambios adicionales:

source: The installation script tries to determine whether or not you need new builds of the libz and libjpeg.
es_ve: El script de instalación trata de determinar si necesita o no nuevas construcciones de libz y libjpeg.

source: If you don't, it won't build them.
es_ve: Si no las necesita, no las construirá.

source: The UI now works more easily with odd-duck platforms like Solaris, where common GNU build tools may be in uncommon locations.
es_ve: La Interfaz de Usuario ahora trabaja más cómoda con plataformas odd-duck como Solaris, donde la herramientas GNU pueden estar en locaciones inusuales.

source: This version omits some optional products (TextIndexNG#, ReportLab) bundled with prior versions.
es_ve: Esta versión omite algunos productos adicionales (TextIndexNG#, ReportLab) incluidos en versiones anteriores.

source: This version includes the new Python easy install kit, though it doesn't use it.
es_ve: Aunque esta versión trae el nuevo kit de fácil instalación de Python, no lo usa.

source: Root or User Install?
es_ve: ¿Instalación como root o usuario normal?

source: The cases for and against installation as the root user.
es_ve: Casos donde se recomienda o no la instalación como usuario root.
